
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       8 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                              |
|:--------:|:---------------------------------------------------------------------------------------|
|    🟢     | `aws_iam_role_policy_attachment.elasticsearch-tester-service-network-permissions`      |
|    🟢     | `aws_iam_role_policy_attachment.elasticsearch-tester-website-pod-permissions`          |
|    🟢     | `module.elasticsearch-tester.aws_iam_policy.pytest-permissions`                        |
|    🟢     | `module.elasticsearch-tester.aws_iam_policy.role-permissions`                          |
|    🟢     | `module.elasticsearch-tester.aws_iam_role.role-tester`                                 |
|    🟢     | `module.elasticsearch-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]` |
|    🟢     | `module.elasticsearch-tester.aws_iam_role_policy_attachment.role-permissions`          |
|    🟢     | `module.elasticsearch-tester.aws_iam_role_policy_attachment.role-pytest-permissions`   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.elasticsearch-tester-service-network-permissions will be created
  + resource "aws_iam_role_policy_attachment" "elasticsearch-tester-service-network-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions"
      + role       = "elasticsearch-tester"
    }

  # aws_iam_role_policy_attachment.elasticsearch-tester-website-pod-permissions will be created
  + resource "aws_iam_role_policy_attachment" "elasticsearch-tester-website-pod-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/website-pod-tester-permissions20231123172741961800000002"
      + role       = "elasticsearch-tester"
    }

  # module.elasticsearch-tester.aws_iam_policy.pytest-permissions will be created
  + resource "aws_iam_policy" "pytest-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "pytest-permissions"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketTagging",
                          + "s3:GetBucketTagging",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "ec2:DescribeRegions",
                          + "dynamodb:TagResource",
                          + "dynamodb:ListTagsOfResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.elasticsearch-tester.aws_iam_policy.role-permissions will be created
  + resource "aws_iam_policy" "role-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "elasticsearch-tester-permissions"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.elasticsearch-tester.aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-elasticsearch:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-elasticsearch"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "elasticsearch-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)
    }

  # module.elasticsearch-tester.aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "elasticsearch-tester"
    }

  # module.elasticsearch-tester.aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "elasticsearch-tester"
    }

  # module.elasticsearch-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "elasticsearch-tester"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.omnibus-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Reading...%0Adata.aws_iam_policy_document.service-network-tester-permissions: Reading...%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]%0Adata.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=3837005140]%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Read complete after 0s [id=4028506576]%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Read complete after 0s [id=2899629952]%0Amodule.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.ecs-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy.administrator-access: Reading...%0Aaws_iam_policy.state-bucket-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/state-bucket-tester-permissions]%0Amodule.github-role-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.gha-admin-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.elasticsearch-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.website-pod-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Aaws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]%0Amodule.jumphost-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.github-role-tester.data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy.read-only-access: Reading...%0Amodule.website-pod-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.gha-admin-tester.data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.website-pod-tester.data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.website-pod-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.infrahouse_com.aws_route53_zone.ci_cd_infrahouse_com: Refreshing state... [id=Z06790082OU0POPWOCPZ4]%0Aaws_iam_role.omnibus: Refreshing state... [id=omnibus]%0Amodule.jumphost-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.jumphost-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=2131231292]%0Amodule.ecs-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.ecs-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.website-pod-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.website-pod-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1538222225]%0Aaws_ec2_serial_console_access.console-uw1: Refreshing state... [id=us-west-1]%0Aaws_iam_role.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only]%0Amodule.jumphost-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.jumphost-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.elasticsearch-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3133841775]%0Adata.aws_iam_policy_document.pytest-permissions: Reading...%0Adata.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.gha-admin-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.ecs-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.elasticsearch-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]%0Amodule.ecs-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ecs-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.ecs-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.gha-admin-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.gha-admin-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]%0Aaws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=2420075302]%0Amodule.github-role-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.github-role-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=3418751069]%0Amodule.gha-admin-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.gha-admin-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=3247938485]%0Aaws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]%0Aaws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]%0Amodule.github-role-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.website-pod-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.jumphost-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231230033000156400000002]%0Aaws_ec2_serial_console_access.console-ue2: Refreshing state... [id=us-east-1]%0Adata.aws_iam_policy.read-only-access: Read complete after 2s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]%0Aaws_ec2_serial_console_access.console-ue1: Refreshing state... [id=us-east-1]%0Amodule.ecs-tester.data.aws_iam_policy.administrator-access: Read complete after 4s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.github-role-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.github-role-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=1596990781]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=3736492159]%0Amodule.website-pod-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.website-pod-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=1399241301]%0Amodule.gha-admin-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.gha-admin-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=3805852011]%0Amodule.website-pod-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231123172741782300000001]%0Amodule.elasticsearch-tester.data.aws_iam_policy.administrator-access: Read complete after 4s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.jumphost-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/jumphost-tester-permissions20231230203905962200000001]%0Amodule.ecs-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231123162055891900000002]%0Amodule.debian-repo-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231109161344894400000002]%0Amodule.website-pod-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/website-pod-tester-permissions20231123172741961800000002]%0Amodule.jumphost-tester.data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.jumphost-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.jumphost-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=3379059500]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-aws-control-303467602807-github]%0Aaws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001]%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=1403333534]%0Amodule.ecs-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.ecs-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=869017062]%0Amodule.ecs-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/ecs-tester-permissions20231123162055891400000001]%0Amodule.gha-admin-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231230002704496000000002]%0Adata.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]%0Amodule.debian-repo-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/debian-repo-tester-permissions20231109161344894400000001]%0Amodule.github-role-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/github-role-tester-permissions20231108005944123200000001]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.gha-admin-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/gha-admin-tester-permissions20231230002704495000000001]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Reading...%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Read complete after 0s [id=123587806]%0Aaws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.gha-admin-tester.data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.github-role-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231108003946028700000002]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only-20230811180635084000000001]%0Amodule.github-role-tester.aws_iam_role.role-tester: Refreshing state... [id=github-role-tester]%0Amodule.debian-repo-tester.aws_iam_role.role-tester: Refreshing state... [id=debian-repo-tester]%0Amodule.website-pod-tester.aws_iam_role.role-tester: Refreshing state... [id=website-pod-tester]%0Amodule.gha-admin-tester.aws_iam_role.role-tester: Refreshing state... [id=gha-admin-tester]%0Amodule.jumphost-tester.aws_iam_role.role-tester: Refreshing state... [id=jumphost-tester]%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Read complete after 0s [id=1923589509]%0Adata.aws_iam_policy_document.service-network-tester-assume: Reading...%0Adata.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]%0Aaws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]%0Amodule.ecs-tester.aws_iam_role.role-tester: Refreshing state... [id=ecs-tester]%0Adata.aws_iam_policy_document.omnibus-permissions: Reading...%0Adata.aws_iam_policy_document.omnibus-permissions: Read complete after 0s [id=4274068248]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache,public-read]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]%0Aaws_iam_role.state-bucket-tester: Refreshing state... [id=state-bucket-tester]%0Aaws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]%0Aaws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.github-role-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=github-role-tester-20231108010822771800000001]%0Amodule.github-role-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=github-role-tester-20231108010822830000000003]%0Amodule.debian-repo-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=debian-repo-tester-20231109161345692400000004]%0Amodule.debian-repo-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=debian-repo-tester-20231109161345698500000005]%0Amodule.gha-admin-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=gha-admin-tester-20231230002944603500000002]%0Amodule.gha-admin-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=gha-admin-tester-20231230002944742600000003]%0Amodule.website-pod-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=website-pod-tester-20231123173533875400000001]%0Amodule.website-pod-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=website-pod-tester-20231123173533923200000002]%0Amodule.ecs-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=ecs-tester-20231123162056194000000004]%0Amodule.ecs-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]: Refreshing state... [id=ecs-tester-20231123162056200000000005]%0Amodule.ecs-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=ecs-tester-20231123162056229900000007]%0Amodule.jumphost-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=jumphost-tester-20231230033000404500000003]%0Amodule.jumphost-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=jumphost-tester-20231230203906216900000002]%0Aaws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions: Refreshing state... [id=website-pod-tester-20231123173533923800000003]%0Aaws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]%0Aaws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions: Refreshing state... [id=state-bucket-tester-20231015195201701500000001]%0Aaws_iam_role_policy_attachment.state-bucket-tester: Refreshing state... [id=state-bucket-tester-20231015203024244400000001]%0Aaws_iam_role_policy_attachment.ecs-tester-website-pod-permissions: Refreshing state... [id=ecs-tester-20231123172742505100000003]%0Aaws_iam_role_policy_attachment.ecs-tester-service-network-permissions: Refreshing state... [id=ecs-tester-20231123162056216700000006]%0Aaws_iam_role_policy_attachment.service-network-tester-pytest-permissions: Refreshing state... [id=service-network-tester-20231009203124842800000002]%0Aaws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]%0Aaws_iam_role_policy_attachment.jumphost-tester-admin-permissions: Refreshing state... [id=jumphost-tester-20231230033000404900000004]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github-20230908004138459800000001]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3570539128]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]%0Amodule.github-role-tester.data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.website-pod-tester.data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.website-pod-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]: Refreshing state... [id=website-pod-tester-20231123173533934900000004]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_role_policy_attachment.elasticsearch-tester-service-network-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "elasticsearch-tester-service-network-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions"%0A      + role       = "elasticsearch-tester"%0A    }%0A%0A  # aws_iam_role_policy_attachment.elasticsearch-tester-website-pod-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "elasticsearch-tester-website-pod-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::303467602807:policy/website-pod-tester-permissions20231123172741961800000002"%0A      + role       = "elasticsearch-tester"%0A    }%0A%0A  # module.elasticsearch-tester.aws_iam_policy.pytest-permissions will be created%0A  + resource "aws_iam_policy" "pytest-permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "pytest-permissions"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutBucketTagging",%0A                          + "s3:GetBucketTagging",%0A                          + "iam:TagRole",%0A                          + "iam:TagPolicy",%0A                          + "ec2:DescribeRegions",%0A                          + "dynamodb:TagResource",%0A                          + "dynamodb:ListTagsOfResource",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A    }%0A%0A  # module.elasticsearch-tester.aws_iam_policy.role-permissions will be created%0A  + resource "aws_iam_policy" "role-permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "elasticsearch-tester-permissions"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "sts:GetCallerIdentity"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A    }%0A%0A  # module.elasticsearch-tester.aws_iam_role.role-tester will be created%0A  + resource "aws_iam_role" "role-tester" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::990466748045:user/aleks"%0A                        }%0A                    },%0A                  + {%0A                      + Action    = "sts:AssumeRoleWithWebIdentity"%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                          + StringLike   = {%0A                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-elasticsearch:*"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Role to test module infrahouse/terraform-aws-elasticsearch"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "elasticsearch-tester"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.elasticsearch-tester.aws_iam_role_policy_attachment.role-admin-permissions[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + role       = "elasticsearch-tester"%0A    }%0A%0A  # module.elasticsearch-tester.aws_iam_role_policy_attachment.role-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "role-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "elasticsearch-tester"%0A    }%0A%0A  # module.elasticsearch-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "elasticsearch-tester"%0A    }%0A%0APlan: 8 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmVsYXN0aWNzZWFyY2gtdGVzdGVyLXNlcnZpY2UtbmV0d29yay1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwiZWxhc3RpY3NlYXJjaC10ZXN0ZXItc2VydmljZS1uZXR3b3JrLXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zXCJcbiAgICAgICsgcm9sZSAgICAgICA9IFwiZWxhc3RpY3NlYXJjaC10ZXN0ZXJcIlxuICAgIH1cblxuICAjIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5lbGFzdGljc2VhcmNoLXRlc3Rlci13ZWJzaXRlLXBvZC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwiZWxhc3RpY3NlYXJjaC10ZXN0ZXItd2Vic2l0ZS1wb2QtcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3dlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uczIwMjMxMTIzMTcyNzQxOTYxODAwMDAwMDAyXCJcbiAgICAgICsgcm9sZSAgICAgICA9IFwiZWxhc3RpY3NlYXJjaC10ZXN0ZXJcIlxuICAgIH1cblxuICAjIG1vZHVsZS5lbGFzdGljc2VhcmNoLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicHl0ZXN0LXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IFwicHl0ZXN0LXBlcm1pc3Npb25zXCJcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOlB1dEJ1Y2tldFRhZ2dpbmdcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOkdldEJ1Y2tldFRhZ2dpbmdcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImlhbTpUYWdSb2xlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJpYW06VGFnUG9saWN5XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJlYzI6RGVzY3JpYmVSZWdpb25zXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpUYWdSZXNvdXJjZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6TGlzdFRhZ3NPZlJlc291cmNlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcIipcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucm9sZS1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJyb2xlLXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiZWxhc3RpY3NlYXJjaC10ZXN0ZXItcGVybWlzc2lvbnNcIlxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzdHM6R2V0Q2FsbGVySWRlbnRpdHlcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCIqXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKVxuICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlciB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwicm9sZS10ZXN0ZXJcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgQVdTID0gXCJhcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnVzZXIvYWxla3NcIlxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlV2l0aFdlYklkZW50aXR5XCJcbiAgICAgICAgICAgICAgICAgICAgICArIENvbmRpdGlvbiA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTdHJpbmdFcXVhbHMgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206YXVkXCIgPSBcInN0cy5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgU3RyaW5nTGlrZSAgID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInRva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tOnN1YlwiID0gXCJyZXBvOmluZnJhaG91c2UvdGVycmFmb3JtLWF3cy1lbGFzdGljc2VhcmNoOipcIlxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUHJpbmNpcGFsID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIEZlZGVyYXRlZCA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKVxuICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICA9IFwiUm9sZSB0byB0ZXN0IG1vZHVsZSBpbmZyYWhvdXNlL3RlcnJhZm9ybS1hd3MtZWxhc3RpY3NlYXJjaFwiXG4gICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICA9IFwiZWxhc3RpY3NlYXJjaC10ZXN0ZXJcIlxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgICAgICAgICAgICA9IFwiL1wiXG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5lbGFzdGljc2VhcmNoLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1hZG1pbi1wZXJtaXNzaW9uc1swXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwicm9sZS1hZG1pbi1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2FybiA9IFwiYXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc1wiXG4gICAgICArIHJvbGUgICAgICAgPSBcImVsYXN0aWNzZWFyY2gtdGVzdGVyXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInJvbGUtcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImVsYXN0aWNzZWFyY2gtdGVzdGVyXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJyb2xlLXB5dGVzdC1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm9sZSAgICAgICA9IFwiZWxhc3RpY3NlYXJjaC10ZXN0ZXJcIlxuICAgIH1cblxuUGxhbjogOCB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1paC1jaWNkLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1paC1jaWNkLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTU0OTg5OTM2XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIxMDE1MDkwNzJdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODM3MDA1MTQwXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDAyODUwNjU3Nl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODk5NjI5OTUyXSUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9wb2xpY3kuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uc10lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBbW9kdWxlLndlYnNpdGUtcG9kLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9yb2xlLmloLXRmLWNpY2QtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtY2ljZC1jb250cm9sXSUwQW1vZHVsZS5qdW1waG9zdC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kucmVhZC1vbmx5LWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzaXRlLXBvZC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLndlYnNpdGUtcG9kLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLndlYnNpdGUtcG9kLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDM4NTMzNzEwXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmNpX2NkX2luZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDY3OTAwODJPVTBQT1BXT0NQWjRdJTBBYXdzX2lhbV9yb2xlLm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXNdJTBBbW9kdWxlLmp1bXBob3N0LXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjEzMTIzMTI5Ml0lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF0lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzaXRlLXBvZC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTM4MjIyMjI1XSUwQWF3c19lYzJfc2VyaWFsX2NvbnNvbGVfYWNjZXNzLmNvbnNvbGUtdXcxOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cy13ZXN0LTFdJTBBYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHldJTBBbW9kdWxlLmp1bXBob3N0LXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMTMzODQxNzc1XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF0lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXQub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQW1vZHVsZS5naGEtYWRtaW4tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFhd3NfaWFtX3BvbGljeS5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zXSUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzNjczNDU0MDFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5naGEtYWRtaW4tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdoYS1hZG1pbi10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF0lMEFtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM2NzM0NTQwMV0lMEFhd3NfaWFtX3VzZXIudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGJfdGVzdF9ydW5uZXJdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjQyMDA3NTMwMl0lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNDE4NzUxMDY5XSUwQW1vZHVsZS5naGEtYWRtaW4tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5naGEtYWRtaW4tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzI0NzkzODQ4NV0lMEFhd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hfc2VjcmV0c19uYW1lc3BhY2VdJTBBYXdzX2lhbV9wb2xpY3kuVHdpbkRCVGVzdFJ1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvVHdpbkRCVGVzdFJ1bm5lcl0lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgM3MgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF0lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyMzEyMzAwMzMwMDAxNTY0MDAwMDAwMDJdJTBBYXdzX2VjMl9zZXJpYWxfY29uc29sZV9hY2Nlc3MuY29uc29sZS11ZTI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVzLWVhc3QtMV0lMEFkYXRhLmF3c19pYW1fcG9saWN5LnJlYWQtb25seS1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L1JlYWRPbmx5QWNjZXNzXSUwQWF3c19lYzJfc2VyaWFsX2NvbnNvbGVfYWNjZXNzLmNvbnNvbGUtdWUxOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cy1lYXN0LTFdJTBBbW9kdWxlLmVjcy10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciA0cyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTk2OTkwNzgxXSUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM3MzY0OTIxNTldJTBBbW9kdWxlLndlYnNpdGUtcG9kLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM5OTI0MTMwMV0lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM4MDU4NTIwMTFdJTBBbW9kdWxlLndlYnNpdGUtcG9kLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMTIzMTcyNzQxNzgyMzAwMDAwMDAxXSUwQW1vZHVsZS5lbGFzdGljc2VhcmNoLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDRzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5qdW1waG9zdC10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvanVtcGhvc3QtdGVzdGVyLXBlcm1pc3Npb25zMjAyMzEyMzAyMDM5MDU5NjIyMDAwMDAwMDFdJTBBbW9kdWxlLmVjcy10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXRlc3QtcGVybWlzc2lvbnMyMDIzMTEyMzE2MjA1NTg5MTkwMDAwMDAwMl0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyMzExMDkxNjEzNDQ4OTQ0MDAwMDAwMDJdJTBBbW9kdWxlLndlYnNpdGUtcG9kLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS93ZWJzaXRlLXBvZC10ZXN0ZXItcGVybWlzc2lvbnMyMDIzMTEyMzE3Mjc0MTk2MTgwMDAwMDAwMl0lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgM3MgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmp1bXBob3N0LXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzM3OTA1OTUwMF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWdpdGh1Yl0lMEFhd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMDA5MjAzMTI0NTU1NTAwMDAwMDAxXSUwQW1vZHVsZS5lbGFzdGljc2VhcmNoLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNDAzMzMzNTM0XSUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9ODY5MDE3MDYyXSUwQW1vZHVsZS5lY3MtdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2Vjcy10ZXN0ZXItcGVybWlzc2lvbnMyMDIzMTEyMzE2MjA1NTg5MTQwMDAwMDAwMV0lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMjMwMDAyNzA0NDk2MDAwMDAwMDAyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgM3MgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBYXdzX2lhbV9hY2Nlc3Nfa2V5LnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QUtJQVVOS0FVRU4zMklXS1JTRVpdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9kZWJpYW4tcmVwby10ZXN0ZXItcGVybWlzc2lvbnMyMDIzMTEwOTE2MTM0NDg5NDQwMDAwMDAwMV0lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2dpdGh1Yi1yb2xlLXRlc3Rlci1wZXJtaXNzaW9uczIwMjMxMTA4MDA1OTQ0MTIzMjAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAzcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9naGEtYWRtaW4tdGVzdGVyLXBlcm1pc3Npb25zMjAyMzEyMzAwMDI3MDQ0OTUwMDAwMDAwMDFdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyMzU4NzgwNl0lMEFhd3NfaWFtX3VzZXJfcG9saWN5X2F0dGFjaG1lbnQudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGJfdGVzdF9ydW5uZXItMjAyMzA3MDExODAwMzEwODQ3MDAwMDAwMDFdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdJTBBbW9kdWxlLmdoYS1hZG1pbi10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAzcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyMzExMDgwMDM5NDYwMjg3MDAwMDAwMDJdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktMjAyMzA4MTExODA2MzUwODQwMDAwMDAwMDFdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5hd3NfaWFtX3JvbGUucm9sZS10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1yb2xlLXRlc3Rlcl0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZGViaWFuLXJlcG8tdGVzdGVyXSUwQW1vZHVsZS53ZWJzaXRlLXBvZC10ZXN0ZXIuYXdzX2lhbV9yb2xlLnJvbGUtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzaXRlLXBvZC10ZXN0ZXJdJTBBbW9kdWxlLmdoYS1hZG1pbi10ZXN0ZXIuYXdzX2lhbV9yb2xlLnJvbGUtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyXSUwQW1vZHVsZS5qdW1waG9zdC10ZXN0ZXIuYXdzX2lhbV9yb2xlLnJvbGUtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC10ZXN0ZXJdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MjM1ODk1MDldJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1ODUxMDg3ODhdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWNpY2QtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtY2ljZC1jb250cm9sLTIwMjMwNjMwMDMwODAzOTYxMjAwMDAwMDAxXSUwQW1vZHVsZS5lY3MtdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWNzLXRlc3Rlcl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQyNzQwNjgyNDhdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X2FjbC5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUscHVibGljLXJlYWRdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjY4Nzc1MjI3MV0lMEFhd3NfaWFtX3JvbGUuc3RhdGUtYnVja2V0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3RhdGUtYnVja2V0LXRlc3Rlcl0lMEFhd3NfaWFtX3JvbGUuc2VydmljZS1uZXR3b3JrLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlcl0lMEFhd3NfaWFtX3BvbGljeS5vbW5pYnVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9vbW5pYnVzMjAyMzA3MjkwNDI0MzE5OTkyMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXSUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9wb2xpY3kucHVibGljLWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1yb2xlLXRlc3Rlci0yMDIzMTEwODAxMDgyMjc3MTgwMDAwMDAwMV0lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLXJvbGUtdGVzdGVyLTIwMjMxMTA4MDEwODIyODMwMDAwMDAwMDAzXSUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kZWJpYW4tcmVwby10ZXN0ZXItMjAyMzExMDkxNjEzNDU2OTI0MDAwMDAwMDRdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZGViaWFuLXJlcG8tdGVzdGVyLTIwMjMxMTA5MTYxMzQ1Njk4NTAwMDAwMDA1XSUwQW1vZHVsZS5naGEtYWRtaW4tdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hhLWFkbWluLXRlc3Rlci0yMDIzMTIzMDAwMjk0NDYwMzUwMDAwMDAwMl0lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hhLWFkbWluLXRlc3Rlci0yMDIzMTIzMDAwMjk0NDc0MjYwMDAwMDAwM10lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyLTIwMjMxMTIzMTczNTMzODc1NDAwMDAwMDAxXSUwQW1vZHVsZS53ZWJzaXRlLXBvZC10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlci0yMDIzMTEyMzE3MzUzMzkyMzIwMDAwMDAwMl0lMEFtb2R1bGUuZWNzLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWNzLXRlc3Rlci0yMDIzMTEyMzE2MjA1NjE5NDAwMDAwMDAwNF0lMEFtb2R1bGUuZWNzLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1hZG1pbi1wZXJtaXNzaW9uc1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWNzLXRlc3Rlci0yMDIzMTEyMzE2MjA1NjIwMDAwMDAwMDAwNV0lMEFtb2R1bGUuZWNzLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVjcy10ZXN0ZXItMjAyMzExMjMxNjIwNTYyMjk5MDAwMDAwMDddJTBBbW9kdWxlLmp1bXBob3N0LXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXRlc3Rlci0yMDIzMTIzMDAzMzAwMDQwNDUwMDAwMDAwM10lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC10ZXN0ZXItMjAyMzEyMzAyMDM5MDYyMTY5MDAwMDAwMDJdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LndlYnNpdGUtcG9kLXRlc3Rlci1zZXJuaXZlLW5ldHdvcmstcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlci0yMDIzMTEyMzE3MzUzMzkyMzgwMDAwMDAwM10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9b21uaWJ1cy0yMDIzMDcyOTA0MjQzMjMyMzQwMDAwMDAwMl0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN0YXRlLWJ1Y2tldC10ZXN0ZXItMjAyMzEwMTUxOTUyMDE3MDE1MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN0YXRlLWJ1Y2tldC10ZXN0ZXItMjAyMzEwMTUyMDMwMjQyNDQ0MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmVjcy10ZXN0ZXItd2Vic2l0ZS1wb2QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVjcy10ZXN0ZXItMjAyMzExMjMxNzI3NDI1MDUxMDAwMDAwMDNdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmVjcy10ZXN0ZXItc2VydmljZS1uZXR3b3JrLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1lY3MtdGVzdGVyLTIwMjMxMTIzMTYyMDU2MjE2NzAwMDAwMDA2XSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlci0yMDIzMTAwOTIwMzEyNDg0MjgwMDAwMDAwMl0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlci0yMDIzMDcwMzE5NDIyNTI4NzYwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuanVtcGhvc3QtdGVzdGVyLWFkbWluLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC10ZXN0ZXItMjAyMzEyMzAwMzMwMDA0MDQ5MDAwMDAwMDRdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViLTIwMjMwOTA4MDA0MTM4NDU5ODAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTcwNTM5MTI4XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW5dJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDNzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS53ZWJzaXRlLXBvZC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAzcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLWFkbWluLXBlcm1pc3Npb25zWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzaXRlLXBvZC10ZXN0ZXItMjAyMzExMjMxNzM1MzM5MzQ5MDAwMDAwMDRdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi0yMDIzMDcwMjE1Mjc0ODY0NjQwMDAwMDAwMV0lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmVsYXN0aWNzZWFyY2gtdGVzdGVyLXNlcnZpY2UtbmV0d29yay1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcImVsYXN0aWNzZWFyY2gtdGVzdGVyLXNlcnZpY2UtbmV0d29yay1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zXCIlMEEgICAgICArIHJvbGUgICAgICAgPSBcImVsYXN0aWNzZWFyY2gtdGVzdGVyXCIlMEEgICAgfSUwQSUwQSAgIyBhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZWxhc3RpY3NlYXJjaC10ZXN0ZXItd2Vic2l0ZS1wb2QtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJlbGFzdGljc2VhcmNoLXRlc3Rlci13ZWJzaXRlLXBvZC1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS93ZWJzaXRlLXBvZC10ZXN0ZXItcGVybWlzc2lvbnMyMDIzMTEyMzE3Mjc0MTk2MTgwMDAwMDAwMlwiJTBBICAgICAgKyByb2xlICAgICAgID0gXCJlbGFzdGljc2VhcmNoLXRlc3RlclwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicHl0ZXN0LXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcInB5dGVzdC1wZXJtaXNzaW9uc1wiJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0QnVja2V0VGFnZ2luZ1wiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOkdldEJ1Y2tldFRhZ2dpbmdcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJpYW06VGFnUm9sZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImlhbTpUYWdQb2xpY3lcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJlYzI6RGVzY3JpYmVSZWdpb25zXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6VGFnUmVzb3VyY2VcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpMaXN0VGFnc09mUmVzb3VyY2VcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiKlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5lbGFzdGljc2VhcmNoLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJyb2xlLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcImVsYXN0aWNzZWFyY2gtdGVzdGVyLXBlcm1pc3Npb25zXCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwic3RzOkdldENhbGxlcklkZW50aXR5XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCIqXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlciB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcInJvbGUtdGVzdGVyXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIEFXUyA9IFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTp1c2VyL2FsZWtzXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVXaXRoV2ViSWRlbnRpdHlcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIENvbmRpdGlvbiA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgU3RyaW5nRXF1YWxzID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJ0b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbTphdWRcIiA9IFwic3RzLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFN0cmluZ0xpa2UgICA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206c3ViXCIgPSBcInJlcG86aW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLWVsYXN0aWNzZWFyY2g6KlwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUHJpbmNpcGFsID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBGZWRlcmF0ZWQgPSBcImFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbVwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICA9IFwiUm9sZSB0byB0ZXN0IG1vZHVsZSBpbmZyYWhvdXNlL3RlcnJhZm9ybS1hd3MtZWxhc3RpY3NlYXJjaFwiJTBBICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMCUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgID0gXCJlbGFzdGljc2VhcmNoLXRlc3RlclwiJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgICAgKyB1bmlxdWVfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLWFkbWluLXBlcm1pc3Npb25zWzBdIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwicm9sZS1hZG1pbi1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXCIlMEEgICAgICArIHJvbGUgICAgICAgPSBcImVsYXN0aWNzZWFyY2gtdGVzdGVyXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJyb2xlLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJlbGFzdGljc2VhcmNoLXRlc3RlclwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJlbGFzdGljc2VhcmNoLXRlc3RlclwiJTBBICAgIH0lMEElMEFQbGFuOiA4IHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMCIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDgsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>